XuHg-zjcn/xx32_hal_libre/common/Drivers/CMSIS/Device/WCH/CH32V1xx/Include/ch32v103x8.h
/**
  ******************************************************************************
  * @file    ch32v103x8.h
  * @author  MCD Application Team, Xu Ruijun
  * @brief   CMSIS QingKeV3 Device Peripheral Access Layer Header File. 
  *          This file contains all the peripheral register's definitions, bits 
  *          definitions and memory mapping for CH32V1xx devices.            
  *            
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *  
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  * This file derived by stm32f103xb.h
  * Copyright (c) 2023 Xu Ruijun
  * Change license under BSD 3-clause, see LICENSE.BSD3 file
  */


/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup ch32v103x8
  * @{
  */
    
#ifndef __CH32V103x8_H
#define __CH32V103x8_H

#ifdef __cplusplus
 extern "C" {
#endif 

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
/**
  * @brief Configuration of the Cortex-M3 Processor and Core Peripherals 
 */
#define __CM3_REV                  0x0200U  /*!< Core Revision r2p0                           */
 #define __MPU_PRESENT             0U       /*!< Other STM32 devices does not provide an MPU  */
#define __NVIC_PRIO_BITS           4U       /*!< STM32 uses 4 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig     0U       /*!< Set to 1 if different SysTick Config is used */

/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief CH32V10x Interrupt Number Definition, according to the selected device 
 *        in @ref Library_configuration_section 
 */

 /*!< Interrupt Number Definition */
typedef enum
{
/******  QingKeV3 Processor PFIC Vector Table Interrupt Numbers ***********************************/
  NonMaskableInt_IRQn         = 2,      /*!< 2 QingKeV3 Non Maskable Interrupt                    */
  HardFault_IRQn              = 3,      /*!< 3 QingKeV3 Exception Interrupt                       */
  SysTick_IRQn                = 12,     /*!< 12 QingKeV3 System Tick Interrupt                    */
  SoftwareInterrupt_IRQn      = 14,     /*!< 14 QingKeV3 Software Trigert Interrupt               */

/******  CH32 specific Interrupt Numbers **********************************************************/
  WWDG_IRQn                   = 16,     /*!< Window WatchDog Interrupt                            */
  PVD_IRQn                    = 17,     /*!< PVD through EXTI Line detection Interrupt            */
  TAMPER_IRQn                 = 18,     /*!< Tamper Interrupt                                     */
  RTC_IRQn                    = 19,     /*!< RTC global Interrupt                                 */
  FLASH_IRQn                  = 20,     /*!< FLASH global Interrupt                               */
  RCC_IRQn                    = 21,     /*!< RCC global Interrupt                                 */
  EXTI0_IRQn                  = 22,     /*!< EXTI Line0 Interrupt                                 */
  EXTI1_IRQn                  = 23,     /*!< EXTI Line1 Interrupt                                 */
  EXTI2_IRQn                  = 24,     /*!< EXTI Line2 Interrupt                                 */
  EXTI3_IRQn                  = 25,     /*!< EXTI Line3 Interrupt                                 */
  EXTI4_IRQn                  = 26,     /*!< EXTI Line4 Interrupt                                 */
  DMA1_Channel1_IRQn          = 27,     /*!< DMA1 Channel 1 global Interrupt                      */
  DMA1_Channel2_IRQn          = 28,     /*!< DMA1 Channel 2 global Interrupt                      */
  DMA1_Channel3_IRQn          = 29,     /*!< DMA1 Channel 3 global Interrupt                      */
  DMA1_Channel4_IRQn          = 30,     /*!< DMA1 Channel 4 global Interrupt                      */
  DMA1_Channel5_IRQn          = 31,     /*!< DMA1 Channel 5 global Interrupt                      */
  DMA1_Channel6_IRQn          = 32,     /*!< DMA1 Channel 6 global Interrupt                      */
  DMA1_Channel7_IRQn          = 33,     /*!< DMA1 Channel 7 global Interrupt                      */
  ADC1_2_IRQn                 = 34,     /*!< ADC1 and ADC2 global Interrupt                       */
  USB_HP_CAN1_TX_IRQn         = 35,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
  USB_LP_CAN1_RX0_IRQn        = 36,     /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
  CAN1_RX1_IRQn               = 37,     /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SCE_IRQn               = 38,     /*!< CAN1 SCE Interrupt                                   */
  EXTI9_5_IRQn                = 39,     /*!< External Line[9:5] Interrupts                        */
  TIM1_BRK_IRQn               = 40,     /*!< TIM1 Break Interrupt                                 */
  TIM1_UP_IRQn                = 41,     /*!< TIM1 Update Interrupt                                */
  TIM1_TRG_COM_IRQn           = 42,     /*!< TIM1 Trigger and Commutation Interrupt               */
  TIM1_CC_IRQn                = 43,     /*!< TIM1 Capture Compare Interrupt                       */
  TIM2_IRQn                   = 44,     /*!< TIM2 global Interrupt                                */
  TIM3_IRQn                   = 45,     /*!< TIM3 global Interrupt                                */
  TIM4_IRQn                   = 46,     /*!< TIM4 global Interrupt                                */
  I2C1_EV_IRQn                = 47,     /*!< I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn                = 48,     /*!< I2C1 Error Interrupt                                 */
  I2C2_EV_IRQn                = 49,     /*!< I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn                = 50,     /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn                   = 51,     /*!< SPI1 global Interrupt                                */
  SPI2_IRQn                   = 52,     /*!< SPI2 global Interrupt                                */
  USART1_IRQn                 = 53,     /*!< USART1 global Interrupt                              */
  USART2_IRQn                 = 54,     /*!< USART2 global Interrupt                              */
  USART3_IRQn                 = 55,     /*!< USART3 global Interrupt                              */
  EXTI15_10_IRQn              = 56,     /*!< External Line[15:10] Interrupts                      */
  RTC_Alarm_IRQn              = 57,     /*!< RTC Alarm through EXTI Line Interrupt                */
  USBWakeUp_IRQn              = 58,     /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
  USBHD_IRQn                  = 59,     /*!< USBHD(CH32 only)                                     */
} IRQn_Type;

/**
  * @}
  */

#include "core_qk3.h"
#include "system_stm32f1xx.h"
#include <stdint.h>

